x = float(input("Введіть координату x: "))
y = float(input("Введіть координату y: "))
if x > 0 and y > 0:
    print("Точка знаходиться в першій чверті.")
elif x < 0 and y > 0:
    print("Точка знаходиться в другій чверті.")
elif x < 0 and y < 0:
    print("Точка знаходиться в третій чверті.")
elif x > 0 and y < 0:
    print("Точка знаходиться в четвертій чверті.")
elif x == 0 and y != 0:
    print("Точка знаходиться на осі Y.")
elif y == 0 and x != 0:
    print("Точка знаходиться на осі X.")
else:
    print("Точка знаходиться в початку координат.")
